#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.commons.module.function_apis_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.commons.module.function_consumptions_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.commons.azurerm_api_management_named_value.ts_api_fn_url will be created
  + resource "azurerm_api_management_named_value" "ts_api_fn_url" {
      + api_management_name = "ts-p-itn-apim-01"
      + display_name        = "ts-api-fn-url"
      + id                  = (known after apply)
      + name                = "ts-api-fn-url"
      + resource_group_name = "ts-p-itn-routing-rg-01"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.commons.azurerm_dashboard.main will be updated in-place
  ~ resource "azurerm_dashboard" "main" {
      ~ dashboard_properties = jsonencode(
          ~ {
              + apiVersion = "2015-08-01-preview"
              + location   = "INSERT LOCATION"
              ~ metadata   = {
                  ~ model = {
                      ~ filters      = {
                          ~ value = {
                              ~ MsPortalFx_TimeRange = {
                                  ~ filteredPartIds = [
                                      - "StartboardPart-LogsDashboardPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb11",
                                      - "StartboardPart-LogsDashboardPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb13",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb15",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb17",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb19",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb1d",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb1f",
                                      - "StartboardPart-LogsDashboardPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb21",
                                      - "StartboardPart-LogsDashboardPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb23",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb27",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb29",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb2b",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb2d",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb2f",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb31",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb35",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb37",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb39",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb3b",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb3d",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb3f",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb41",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb43",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb45",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb47",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb49",
                                      - "StartboardPart-MonitorChartPart-4e036e84-88f0-4bd2-b97c-792a9bcdbb4b",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b012",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b014",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b016",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b018",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b01a",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b01c",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b020",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b022",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b024",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b026",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b028",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b02a",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b02c",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b030",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b032",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b034",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b036",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b038",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b03a",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b03c",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b03e",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b040",
                                      + "StartboardPart-MonitorChartPart-5a90892a-7953-419c-a037-a8d44255b042",
                                      + "StartboardPart-LogsDashboardPart-5a90892a-7953-419c-a037-a8d44255b044",
                                      + "StartboardPart-LogsDashboardPart-5a90892a-7953-419c-a037-a8d44255b046",
                                      + "StartboardPart-LogsDashboardPart-5a90892a-7953-419c-a037-a8d44255b048",
                                      + "StartboardPart-LogsDashboardPart-5a90892a-7953-419c-a037-a8d44255b04a",
                                    ]
                                    # (2 unchanged attributes hidden)
                                }
                            }
                        }
                        # (2 unchanged attributes hidden)
                    }
                }
              + name       = "Main"
              + tags       = {
                  + hidden-title = "Main"
                }
              + type       = "Microsoft.Portal/dashboards"
                # (1 unchanged attribute hidden)
            }
        )
        id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-dashboards-rg-01/providers/Microsoft.Portal/dashboards/Main"
        name                 = "Main"
      ~ tags                 = {
          - "hidden-title" = "Main" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.commons.module.func_api.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-api-func-01] Health Check Failed"
      + resource_group_name      = "ts-p-itn-api-rg-01"
      + scopes                   = [
          + "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-api-rg-01/providers/Microsoft.Web/sites/ts-p-itn-api-func-01",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.commons.module.func_api.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[tspitnapistfn01] Low Availability"
      + resource_group_name      = "ts-p-itn-api-rg-01"
      + scopes                   = [
          + "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-api-rg-01/providers/Microsoft.Storage/storageAccounts/tspitnapistfn01",
        ]
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.commons.module.func_consumers.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-consumers-func-01] Health Check Failed"
      + resource_group_name      = "ts-p-itn-consumers-rg-01"
      + scopes                   = [
          + "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-consumers-rg-01/providers/Microsoft.Web/sites/ts-p-itn-consumers-func-01",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.commons.module.func_consumers.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[tspitnconsumersstfn01] Low Availability"
      + resource_group_name      = "ts-p-itn-consumers-rg-01"
      + scopes                   = [
          + "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-consumers-rg-01/providers/Microsoft.Storage/storageAccounts/tspitnconsumersstfn01",
        ]
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.commons.azurerm_dashboard.main,
  on ../modules/commons/dashboard.tf line 7, in resource "azurerm_dashboard" "main":
   7: resource "azurerm_dashboard" "main" {

The `azurerm_dashboard` resource is deprecated and will be removed in v4.0 of
the AzureRM Provider - the replacement is available as
`azurerm_portal_dashboard`.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 14 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
